
const state = {
    //提交按钮状态
    loading: false,
    users:{
        headImg:'',  //登录会员头像
        account:'',  //登录会员名称
    },
    
    //定位面包屑
    BreadShow: true,   //面包屑是否展示
    breadList:[],      //面包屑列表：{value:"",url:""}
    breadValue:'',     //面包屑名称
    ContentShow: false,//主体是否100%(false不是100%展示，true是100%展示)

    /* 弹出层状态 */
    model:{
        editType: false,    //添加或编辑
        hint: false,        //提示
        nexus: false,       //关联关系
    },
    
    classifyList:[],    //分类列表
};

//常量
const constant = {
    //环境（开发、测试、预上线、线上）
    condition:['ms.****.com','preview-ms.****.com','test-ms.****.com','dev-ms.****.com'],
    //浏览器错误状态
    httpStatus:['500','501','502','503','504','505','400','401','403','404','405','406','407','408','409','410','411','412','413','414','415','416','417'],
    httpText:[
        "错误500，服务器遇到不可预知的情况",
        "错误501，服务器不支持所请求的功能",
        "错误502，服务器从上游服务器收到一个无效的响应",
        "错误503，服务器临时过载或当机",
        "错误504，网关超时",
        "错误505，服务器不支持请求中指明的HTTP协议版本",
        "错误400，语法有误，您的请求无法被服务器理解",
        "错误401，您没有访问权限，请进行身份认证",
        "错误403，服务器拒绝您的访问",
        "错误404，服务器无法找到您请求的页面",
        "错误405，请求中指定的方法不被允许",
        "错误406，服务器反馈的数据无法被客户端所接受",
        "错误407，您需进行代理身份验证",
        "错误408，请求超出了服务器的等待时间",
        "错误409，服务器冲突，请求无法被完成",
        "错误410，您请求的页面不可用",
        "错误411，'Content-Length'未被定义",
        "错误412，您请求中的前提条件被服务器评估为失败",
        "错误413，您所请求的实体的太大，服务器无法接受请求",
        "错误414，您的url太长，服务器无法接受请求",
        "错误415，由于媒介类型不被支持，服务器不会接受请求",
        "错误416，服务器不能满足客户在请求中指定的Range头",
        "错误417，预期结果失败",
    ],
};

export { constant,state };
